Repository: nycholas/nycholas
Catalog: projects/ask-undrgz/src/ask-undrgz/ask_undrgz/conf/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: From and message is required
pt_br: Para e mensagem são necessários

source: XMPP requires POST
pt_br: É necessário POST

source: +1 stupid question!
pt_br: +1 pergunta estúpida!

source: Failed to get a request token: %(error)s
pt_br: Falha ao receber uma solicitação de token: %(error)s

source: Missing required parameters!
pt_br: Faltam parâmetros obrigatórios!

source: Failed to get access token: %(error)s
pt_br: Falha ao obter o token de acesso: %(error)s

source: underguiz - page error!
pt_br: underguiz - página de erro!

source: underguiz says
pt_br: underguiz diz

source: Page not found!
pt_br: Página não encontrada!

source: Recent stupid questions
pt_br: Perguntas estúpidas recentes

source: WTF?
pt_br: FDP?

source: Where's my phone?
pt_br: Onde está o meu telefone?

source: How many pounds I'll lose weight today?
pt_br: Quantos quilos eu vou perder hoje?

source: Written by
pt_br: Escrito por

source: Uses data from
pt_br: Utiliza dados a partir de

source: underguiz - online
pt_br: underguiz - conectado

source: underguiz - offline
pt_br: underguiz - ausente

source: Loading...
pt_br: Carregando...

source: ask-undrgz :: system of questions uses data from underguiz
pt_br: ask-undrgz :: Sistema de perguntas utilizando os dados a partir de underguiz

source: Ask a question to underguiz (WTF?, Where's my phone?, How many pounds am I going to lose today?):
pt_br: Faça uma pergunta ao underguiz (FDP?, Onde está o meu telefone?, Quantos quilos eu vou perder hoje?):

source: Send question
pt_br: Enviar pergunta
